# Data selection and subsetting with loc and iloc

## 1. loc

Access rows and columns by labels

Rules:

- loc:

    `dataframe.loc[Row, Column]`
    
    `dataframe.loc[Desired row(s), Desired column(s)]`

In [1]:
import pandas as pd
import numpy as np

In [4]:
students_score = {
    'Name' : ['Paul', 'Aaron', 'Krista', 'Veronica', 'Paxton', 'Madison', 'Aurora'],
    'Score': [98, 89, 99, 87, 90, 83, 82],
    'Grades': ['AA', 'AB', 'AA', 'AC', 'AB', 'BA', 'BB']
}

df_students = pd.DataFrame(students_score)

In [5]:
df_students

       Name  Score Grades
0      Paul     98     AA
1     Aaron     89     AB
2    Krista     99     AA
3  Veronica     87     AC
4    Paxton     90     AB
5   Madison     83     BA
6    Aurora     82     BB

The code below means 'select row with index 0 or select first row of all columns'

In [6]:
df_students.loc[0, :]

Name      Paul
Score       98
Grades      AA
Name: 0, dtype: object

This code below means 'select row 0, 1, 2 of all columns'

In [7]:
df_students.loc[[0, 1, 2], :]

     Name  Score Grades
0    Paul     98     AA
1   Aaron     89     AB
2  Krista     99     AA

The code above can be simplified with:

In [8]:
df_students.loc[0:2, :]

     Name  Score Grades
0    Paul     98     AA
1   Aaron     89     AB
2  Krista     99     AA

Using column names

In [9]:
df_students.loc[:, 'Name']

0        Paul
1       Aaron
2      Krista
3    Veronica
4      Paxton
5     Madison
6      Aurora
Name: Name, dtype: object

In [10]:
df_students.loc[:, ['Name', 'Score']]

       Name  Score
0      Paul     98
1     Aaron     89
2    Krista     99
3  Veronica     87
4    Paxton     90
5   Madison     83
6    Aurora     82

In [12]:
df_students.loc[:, 'Name':]

       Name  Score Grades
0      Paul     98     AA
1     Aaron     89     AB
2    Krista     99     AA
3  Veronica     87     AC
4    Paxton     90     AB
5   Madison     83     BA
6    Aurora     82     BB

## 2. iloc

Access rows and columns by indices

Rules:

- iloc:

    Access a group of rows and columns by integer position(s)
    
    `dataframe.iloc[First Inclusive, Last Exclusive]`

In [18]:
df_students.iloc[0, :]

Name      Paul
Score       98
Grades      AA
Name: 0, dtype: object

In [13]:
df_students.iloc[:, 0]

0        Paul
1       Aaron
2      Krista
3    Veronica
4      Paxton
5     Madison
6      Aurora
Name: Name, dtype: object

In [15]:
df_students.iloc[:, 0:2]

       Name  Score
0      Paul     98
1     Aaron     89
2    Krista     99
3  Veronica     87
4    Paxton     90
5   Madison     83
6    Aurora     82

In [16]:
df_students.iloc[:, 0:]

       Name  Score Grades
0      Paul     98     AA
1     Aaron     89     AB
2    Krista     99     AA
3  Veronica     87     AC
4    Paxton     90     AB
5   Madison     83     BA
6    Aurora     82     BB

In [24]:
df_students.iloc[[0, 1], [0, 1]]

    Name  Score
0   Paul     98
1  Aaron     89

In [25]:
df_students.iloc[0:3, :]

     Name  Score Grades
0    Paul     98     AA
1   Aaron     89     AB
2  Krista     99     AA